/** Arduino, ESP32, C/C++ *************************************** DefWiFi.h ***
 * 
 *                             Определения для собственных сетей контроллеров и
 *                                          параметры возможных локальных сетей
 *                                                     
 * v1.0.1, 26.03.2026                                 Автор:      Труфанов В.Е.
 * Copyright © 2026 tve                               Дата создания: 20.03.2026
**/

#pragma once     

// Формируем данные массива учетных записей возможных локальных сетей
#define net_accounts
int narr = 6;        // число элементов в массиве
const char* sarr[] =  // массив учетных данных
{
  "TP-Link_B394",  "18009217",
  "OPPO A9 2020",  "b277a4ee84e8",
  "tve-MONOBLOCK", "Ue18-647",
};
// Определяем SSID собственной сети контроллера
// "Контроллер №1" - камера для съёмок на природе   ["DachaSad"]
// "ESP_75C391"    - ESP32-CAM, контроллер №3       ["NaDorogu"]
// "ESP_A7E119"    - ESP32-CAM, контроллер №6 
#define soft_ap_ssid "DachaSad" 
#define soft_ap_pass "DachaSad" 

// Подключаем библиотеку сканирование сетей WiFi, выбор и ведение 
// локальной сети WiFi и собственной сети контроллера 
#include "ChipWiFi.h"

// ************************************************************** DefWiFi.h ***
